In [1]:
import pandas as pd

In [2]:
pd.Series([2,5,-2,.9])

0    2.0
1    5.0
2   -2.0
3    0.9
dtype: float64

In [9]:
data = [input("Enter your data")]
print(data)

Enter your data12,45,78
['12,45,78']

In [10]:
pd.Series(data)

0    12,45,78
dtype: object

In [45]:
obj = pd.Series([input("Enter your data")])

Enter your data45,-5,66,88

In [25]:
import numpy as np

print(obj)
la = np.array([ 4,  7, -5,  3])
la

0    28,25,22,20
dtype: object

array([ 4,  7, -5,  3])

In [24]:
pd.Series(la)

0    4
1    7
2   -5
3    3
dtype: int32

In [27]:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [30]:
obj2['a']

-5

In [31]:
obj2['b'] = 45

In [33]:
obj2['b']

45

In [34]:
obj2

d     4
b    45
a    -5
c     3
dtype: int64

In [35]:
obj2[['c', 'a', 'd']]

c    3
a   -5
d    4
dtype: int64

In [36]:
obj2[obj2 > 0]

d     4
b    45
c     3
dtype: int64

In [37]:
obj2 + obj

0    NaN
a    NaN
b    NaN
c    NaN
d    NaN
dtype: object

In [38]:
obj

0    28,25,22,20
dtype: object

In [39]:
obj2 * obj

0    NaN
a    NaN
b    NaN
c    NaN
d    NaN
dtype: object

In [46]:
obj*2

0    45,-5,66,8845,-5,66,88
dtype: object

In [41]:
obj2*2

d     8
b    90
a   -10
c     6
dtype: int64

In [48]:
np.exp(obj2)

d    5.459815e+01
b    3.493427e+19
a    6.737947e-03
c    2.008554e+01
dtype: float64

In [52]:
data = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = pd.Series(data)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [53]:
city = ['karachi', 'lahore', 'islamabad', 'multan']
city

['karachi', 'lahore', 'islamabad', 'multan']

In [54]:
index = [1,2,3,4]

In [55]:
pd.Series(city, index)

1      karachi
2       lahore
3    islamabad
4       multan
dtype: object

In [57]:
pd.Series(data, index)

1   NaN
2   NaN
3   NaN
4   NaN
dtype: float64

In [58]:
pd.DataFrame(data, index)

    Ohio  Texas  Oregon  Utah
1  35000  71000   16000  5000
2  35000  71000   16000  5000
3  35000  71000   16000  5000
4  35000  71000   16000  5000

In [59]:
pd.DataFrame(city, index)

           0
1    karachi
2     lahore
3  islamabad
4     multan

In [74]:
obj3 = pd.DataFrame(data,city)
obj3

            Ohio  Texas  Oregon  Utah
karachi    35000      0   16000  5000
lahore     35000      0   16000  5000
islamabad  35000      0   16000  5000
multan     35000      0   16000  5000

In [62]:
pd.isnull(data)

False

In [63]:
data

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [68]:
texes = 0

In [69]:
data

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [70]:
data['Texas'] = 0

In [71]:
data

{'Ohio': 35000, 'Texas': 0, 'Oregon': 16000, 'Utah': 5000}

In [72]:
pd.isnull(data)

False

In [80]:
data = {'city' :['karachi', 'lahore', 'islamabad', 'multan','quetta','hydrabad' ],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
frame

        city  year  pop
0    karachi  2000  1.5
1     lahore  2001  1.7
2  islamabad  2002  3.6
3     multan  2001  2.4
4     quetta  2002  2.9
5   hydrabad  2003  3.2

In [84]:
 pd.DataFrame(data, columns=['year', 'city', 'pop'])

   year       city  pop
0  2000    karachi  1.5
1  2001     lahore  1.7
2  2002  islamabad  3.6
3  2001     multan  2.4
4  2002     quetta  2.9
5  2003   hydrabad  3.2

In [104]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
   ....:                       index=['one', 'two', 'three', 'four',
   ....:                              'five', 'six'])
frame2

       year state  pop debt
one    2000   NaN  1.5  NaN
two    2001   NaN  1.7  NaN
three  2002   NaN  3.6  NaN
four   2001   NaN  2.4  NaN
five   2002   NaN  2.9  NaN
six    2003   NaN  3.2  NaN

In [113]:
frame2['state']='city'

In [118]:
frame2['debt'] = '5.2'

In [119]:
frame2

       year state  pop debt
one    2000  city  1.5  5.2
two    2001  city  1.7  5.2
three  2002  city  3.6  5.2
four   2001  city  2.4  5.2
five   2002  city  2.9  5.2
six    2003  city  3.2  5.2

In [125]:
frame2['debt'] = np.arange(6)

In [126]:
frame2

       year state  pop  debt
one    2000  city  1.5     0
two    2001  city  1.7     1
three  2002  city  3.6     2
four   2001  city  2.4     3
five   2002  city  2.9     4
six    2003  city  3.2     5

In [127]:
 val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])

In [128]:
val

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [130]:
frame2['debt'] = val

In [131]:
frame2

       year state  pop  debt
one    2000  city  1.5   NaN
two    2001  city  1.7  -1.2
three  2002  city  3.6   NaN
four   2001  city  2.4  -1.5
five   2002  city  2.9  -1.7
six    2003  city  3.2   NaN

In [134]:
 frame2['eastern'] = frame2.state == 'city'

In [135]:
frame2

       year state  pop  debt  eastern
one    2000  city  1.5   NaN     True
two    2001  city  1.7  -1.2     True
three  2002  city  3.6   NaN     True
four   2001  city  2.4  -1.5     True
five   2002  city  2.9  -1.7     True
six    2003  city  3.2   NaN     True

In [139]:
 frame2['eastern'] = frame2.year == 2002
frame2

       year state  pop  debt  eastern
one    2000  city  1.5   NaN    False
two    2001  city  1.7  -1.2    False
three  2002  city  3.6   NaN     True
four   2001  city  2.4  -1.5    False
five   2002  city  2.9  -1.7     True
six    2003  city  3.2   NaN    False